# На първия ред ще получите поредица от числа, разделени с един интервал.
# На втория ред ще получите стринг.
# Вашата задача е да напишете програма, която изпраща съобщение само с помощта на знаци от дадения низ.
# Всеки символ, който програмата добавя към съобщението, трябва да бъде намерен по неговия индекс.
# Индексът, който търсите, е сборът от цифрите на числото от първата последователност.
# Ако индексът е по-голям от дължината на текста, продължете да броите отначало (за да имате винаги валиден индекс).
# Когато намерите знак, трябва да го добавите към съобщението и да го премахнете от низа.
# Това означава, че за следващия индекс текстът ще съдържа един знак по-малко.
# Отпечатайте последното съобщение.

list_numbers = input().split()
initial_string = list(input())
index_list = []
message = ""

for number in list_numbers:
    index = 0
    for digit in number:
        index += int(digit)
    index_list.append(index)

for index in index_list:
    if index >= len(initial_string):
        index -= len(initial_string)
    message += initial_string[index]
    initial_string.remove(initial_string[index])

print(message)