# 1. set - Как действа:
# example_set = {"Gosho","Pesho", "Gosho"}
# print(example_set)
# Връща {'Gosho', 'Pesho'}, защото сет връща само уникалните елементи!
# Не гарантира мястото на Gosho i Pesho!

# 2.
# example_set = {"1","9", "9", "8"}
# print(example_set)
# Ще връща {'8', '9', '1'} , разбъркани само три цифри, защото 9 се повтаря два пъти!

# 3.
# example_set = {"1","9", "7", "8"}
# print(example_set)
# Ще връща {'7', '1', '8', '9'} , защото всички цифри са различни!

# 4. Ако е списък, запазва позициите:
example_set = ["1","9", "7", "8"] #  С тези скоби, не къдравите!
print(example_set)