# Повечето футболни фенове го обичат заради головете и вълнението. Е, този проблем не е така.
# Вие трябва да боравите с малкото тефтерче на съдията и да преброите играчите,
# които са били изгонени за нарушения и лошо поведение.
# Правилата: Два отбора, наречени "А" и "Б" имат по 11 играча. Играчите на всеки отбор са номерирани от 1 до 11.
# Всеки играч може да бъде изгонен от терена, като му бъде даден червен картон.
# Ако в един от отборите останат по-малко от 7 играчи, съдията незабавно спира играта и
# отборът с по-малко от 7 играчи губи.
# Картата е низ с буквата на отбора ("A" или "B"), последвана от едно тире и номера на играча.
# Например картата "B-7" означава, че играч №7 от отбор B е получил карта.
# Задачата: Ще ви бъде дадена последователност от карти (може да са празни), разделени с един интервал.
# Трябва да отпечатате броя на оставащите играчи във всеки отбор в края на играта във формата:
# „Отбор A – {брой_играчи}; Отбор Б – {брой_играчи}“. Ако съдията прекрати играта, отпечатайте допълнителен ред:
# „Играта беше прекратена“.
# Забележка за произволните тестове: Ако играч, който вече е бил изгонен, получи друга карта - игнорирайте я.



team_a = ['A-1', 'A-2', 'A-3', 'A-4', 'A-5', 'A-6', 'A-7', 'A-8', 'A-9', 'A-10', 'A-11']
team_b = ['B-1', 'B-2', 'B-3', 'B-4', 'B-5', 'B-6', 'B-7', 'B-8', 'B-9', 'B-10', 'B-11']
# team_a = ["A-" + str(s) for s in range(1,12)]
# team_b = ["B-" + str(s) for s in range(1,12)]
players = input().split()
game_was_terminated = False
for player in players:
    if player in team_a:
        team_a.remove(player)
    elif player in team_b:
        team_b.remove(player)
    if len(team_a) < 7 or len(team_b) < 7:
        game_was_terminated = True
        break
print(f"Team A - {len(team_a)}; Team B - {len(team_b)}")
if game_was_terminated: #if game_was_terminated == True
    print("Game was terminated")