# Групата авантюристи се зае с първата си задача. Сега трябва да минат през огън - буквално.
# Те трябва да използват цялата вода, която им е останала. Вашата задача е да им помогнете да оцелеят.
# Създайте програма, която изчислява водата, необходима за гасене на „пожарна клетка“,
# въз основа на предоставената информация за нейното „ниво на пожар“ и колко е засегната от водата.
# Първо ще ви бъде дадено нивото на пожар вътре в клетката с целочислената стойност на клетката,
# което представлява необходимата вода за гасенето на огъня. Те ще бъдат дадени в следния формат:
# "{typeOfFire} = {valueOfCell}#{typeOfFire} = {valueOfCell}# … {typeOfFire} = {valueOfCell}"
# След това ще получите количеството вода, което имате за гасене на пожарите.
# Има диапазон на пожар за всеки тип пожар и ако стойността на клетка е под или надвишава нея,
# тя е невалидна и не е необходимо да я гасите.
# Тип пожарен диапазон
# Висока 81 - 125
# Среден 51 - 80
# Ниска 1 - 50
# Ако една клетка е валидна, трябва да я изгасите, като намалите водата с нейната стойност.
# Гасенето на пожар също изисква усилия и трябва да ги пресметнете.
# Стойността му е равна на 25% от стойността на клетката. В крайна сметка ще трябва да отпечатате общото усилие.
# Продължете да пускате клетки, докато не ви свърши водата. Пропуснете го и опитайте следващия,
# ако нямате достатъчно вода, за да изгасите дадена клетка. Накрая отпечатайте клетките,
# които сте поставили в следния формат:
# „Клетки:
#  - {клетка1}
#  - {клетка2}
#  …
#  - {cellN}"
# „Усилие: {усилие}“
# Усилието трябва да бъде форматирано до втория знак след десетичната запетая.
# Накрая отпечатайте общия пожар, който сте потушили от всички клетки в следния формат:
# „Пълен пожар: {total_fire}“
# Вход / Ограничения
# • На 1-ви ред ще получите пожарите с техните клетки в описания по-горе формат – цели числа в диапазона [1…500].
# • На 2-ри ред ще получите водата – цяло число от диапазона [0….100000].
# Изход
# Отпечатайте резултата, както е описано по-горе.

fires = input().split("#")
water = int(input())
effort = 0   # усилие
total_fire = 0
cells_put_out = []
for number in range(len(fires)):
    fire = fires[number].split(" = ")
    fire_type = fire[0]
    cell_value = int(fire[1])
    cell_is_valid = False

    if (fire_type == "High" and 81 <= cell_value <= 125) or \
            (fire_type == "Medium" and 51 <= cell_value <= 80) or \
            (fire_type == "Low" and 1 <= cell_value <= 50):
        cell_is_valid = True

    if cell_is_valid and water >= cell_value:
        water -= cell_value
        effort += 0.25 * cell_value
        total_fire += cell_value
        cells_put_out.append(cell_value)

print("Cells:")
for cell in cells_put_out:
    print(f' - {cell}')
print(f"Effort: {effort:.2f}")
print(f"Total Fire: {total_fire}")

# След като прочетем изхода, започваме да проверяваме нивото на пожара и неговата валидност.
# Първото е валидно, така че изваждаме 89 от количеството вода – 1250 и водата става 1161.
# Трябва да изчислим усилието, което е 25% от 89. Ще добавим 89 към общия пожар, който сме потушили .
# В крайна сметка усилието е 54,22, а общият огън: 217