# Искате да отидете до Франция с влак, а билетът за влака струва точно 150$.
# Нямате достатъчно пари, затова решавате да закупите някои артикули с бюджета си и
# след това да ги продадете на по-висока цена – с надценка от 40%.
# Ще получите колекция от елементи и бюджет в следния формат:
# {type->price|type->price|type->price……|type->price}
# {budget}
# Цените за всеки от видовете не могат да надвишават конкретна цена, която е дадена по-долу:
# Clothes	50.00
# Shoes	35.00
# Accessories	20.50
# Ако цената за определен артикул е по-висока от максималната цена, не го купувайте.
# Всеки път, когато купувате артикул, трябва да намалите бюджета с неговата цена.
# Ако нямаш достатъчно пари за него, не можеш да го купиш. Купете колкото можете повече артикули.
# След това трябва да увеличите цената на всеки артикул, който успешно сте купили, с 40% и след това да го продадете.
# Изчислете дали бюджетът след продажбата на всички артикули е достатъчен за закупуване на билета за влак.
# Вход / Ограничения
# • На 1-ви ред ще получите артикулите с техните цени в описания по-горе формат – реални числа в диапазона [0.00……1000.00]
# • На 2-ри ред ще ви бъде даден бюджетът – реално число в диапазона [0.0….1000.0]
# Изход
# • Първо отпечатайте списъка с новите цени на закупения артикул,
# форматирани до втория десетичен знак в следния формат:
# „{price1} {price2} {price3} … {priceN}“


ticket_cost = 150
items_list = input().split("|")
budget = int(input())
profit = 0
sell_price_list = []

for element in items_list:
    element = element.split("->")
    item, price = element[0], float(element[1])
    if price > budget:
        continue
    if (item == "Clothes" and price <= 50) or \
            (item == "Shoes" and price <= 35) or \
            (item == "Accessories" and price <= 20.50):
        budget -= price
        sell_price = 1.40 * price
        sell_price_list.append(sell_price)
        profit += 0.40 * price

for sell_price_element in sell_price_list:
    print(f"{sell_price_element:.2f}", end=" ")
print()
print(f"Profit: {profit:.2f}")
if budget + sum(sell_price_list) >= ticket_cost:
    print("Hello, France!")
else:
    print("Not enough money.")