# Като млад пекар, вие печете хляба от пекарната.
# Имате начална енергия 100 и начални монети 100. Ще ви бъде даден низ, представляващ събитията от работния ден.
# Всяко събитие е разделено с '|' (вертикална лента): "събитие1|събитие2| … събитиеN"
# Всяко събитие съдържа име на събитие или съставка и номер, разделени с тире („{събитие/съставка}-{номер}“)
# • Ако събитието е "почивка":
# o Получавате енергия (числото във втората част).
# Забележка: вашата енергия не може да надвишава първоначалната ви енергия (100).
# Отпечатайте: „Спечелихте {gained_energy} енергия.“.
# o След това отпечатайте текущата си енергия: „Текуща енергия: {current_energy}.“.
# • Ако събитието е "поръчка":
# o Спечелихте монети (числото във втората част).
# o Всеки път, когато получите поръчка, енергията ви намалява с 30 точки.
#  Ако имате енергията да завършите поръчката, отпечатайте: „Спечелихте {спечелихте} монети.“.
#  В противен случай пропуснете поръчката и спечелете 50 енергийни точки. Отпечатайте: „Трябваше да си починете!“.
# • Във всеки друг случай имате съставка, която трябва да купите. Втората част на събитието съдържа монетите,
# които трябва да похарчите.
# o Ако имате достатъчно пари, трябва да купите съставката и да отпечатате:
# „Купихте {съставка}.“
# o В противен случай отпечатайте „Затворено! Не мога да си позволя {съставка}.“ и вашата пекарна свърши.
# Ако сте успели да се справите с всички събития през деня, отпечатайте на следните 3 реда:
# „Денят завършен!“
# „Монети: {coins}“
# „Енергия: {energy}“
# Вход / Ограничения
# Ще получите низ, представляващ събитията от работния ден, разделени с '|' (вертикална лента) във формат:
# "събитие1|събитие2| … събитиеN".
# Всяко събитие съдържа име на събитие или съставка и номер, разделени с тире във формат: „{събитие/съставка}-{номер}“
# Изход
# Отпечатайте съответните съобщения, описани по-горе.


events = input().split("|")
total_coins = 100
total_energy = 100
factory_is_open = True
for event in events:
    event_items = event.split("-")
    type_of_event = event_items[0]
    event_value = int(event_items[1])
    if type_of_event == "rest":
        current_energy = total_energy
        total_energy += event_value
        if total_energy > 100:
            total_energy = 100
        gained_energy = total_energy - current_energy
        print(f"You gained {gained_energy} energy.")
        print(f"Current energy: {total_energy}.")
    elif type_of_event == "order":
        if total_energy >= 30:
            total_energy -= 30
            total_coins += event_value
            print(f"You earned {event_value} coins.")
        else:
            total_energy += 50
            print("You had to rest!")

    else:
        if total_coins >= event_value:
            total_coins -= event_value
            print(f"You bought {type_of_event}.")
        else:
            print(f"Closed! Cannot afford {type_of_event}.")
            factory_is_open = False
            break
if factory_is_open:  # if factory_is_open == True
    print("Day completed!")
    print(f"Coins: {total_coins}")
    print(f"Energy: {total_energy}")
